init-files/packages.org
#+TITLE: packages.org - 2026
#+AUTHOR: Chris
#+STARTUP: showeverything
#+PROPERTY: header-args :tangle "~/.emacs.d/init-files/packages.el"
#+auto_tangle: t

* Packages

** Theme
#+begin_src emacs-lisp
  (setq custom-safe-themes t)
  (use-package color-theme-sanityinc-tomorrow
    :ensure t
    :config
    (load-theme 'sanityinc-tomorrow-night t))
#+end_src

** no-littering
#+begin_src emacs-lisp
  (use-package no-littering)
#+end_src

** vterm
#+begin_src emacs-lisp
  (use-package vterm
    :ensure t
    :custom
    (vterm-max-scrollback 20000)
    :hook
    ;; Set up vterm to enable quick copying via selecting with the mouse
    (vterm-mode . (lambda ()
                    (setq mouse-drag-copy-region t))))
#+end_src

** rainbow-delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :defer t
    :hook ((prog-mode org-mode) . rainbow-delimiters-mode))
#+end_src

** diredfl
#+begin_src emacs-lisp
  (use-package diredfl
    :defer t
    :hook (dired-mode . diredfl-mode))
#+end_src

** dired-subtree
#+begin_src emacs-lisp
  (use-package dired-subtree
    :ensure t
    :after dired
    :config
    (setq dired-subtree-use-backgrounds nil))
#+end_src

** trashed
#+begin_src emacs-lisp
  (use-package trashed
    :ensure t
    :commands (trashed)
    :config
    (setq trashed-use-header-line t)
    (setq trashed-sort-key '("Date deleted" . t))
    (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))
#+end_src

** vundo
Visual undo tree for Emacs. Overwrites the default undo key and dispays the Vundo tree.
#+begin_src emacs-lisp
  (use-package vundo
    :ensure t)
#+end_src

** magit

*** Enable magit
#+begin_src emacs-lisp
  (use-package magit
    :ensure t)
#+end_src

*** Set the default behavior of the Magit buffer to reuse the current window
#+begin_src emacs-lisp
  (setq display-buffer-alist
        '(("magit:.**"
           (display-buffer-reuse-window display-buffer-same-window))))
#+end_src

*** Add magit as an option to project.el
#+begin_src emacs-lisp
  (with-eval-after-load 'project
    (add-to-list 'project-switch-commands '(magit-project-status "Magit" ?m) t))
#+end_src

** minions
#+begin_src emacs-lisp
  (use-package minions
    :config
    (minions-mode 1))
#+end_src

** vertico
#+begin_src emacs-lisp
  (use-package vertico
    :init
    (vertico-mode))
#+end_src

** marginalia
#+begin_src emacs-lisp
  (use-package marginalia
    :init
    (marginalia-mode))
#+end_src

** embark
#+begin_src emacs-lisp
  (use-package embark
    :ensure t
    :init
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :ensure t)
#+end_src

** orderless
#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

** consult
#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :config
    (setq consult-line-start-from-top t))
#+end_src

** sudo-edit
#+begin_src emacs-lisp
  (use-package sudo-edit
    :defer t
    :after embark)
#+end_src

** wgrep
Lets us edit the results of a grep search while inside a grep-mode buffer
#+begin_src emacs-lisp
  (use-package wgrep
    :ensure t)
#+end_src

** corfu
#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :hook (after-init . global-corfu-mode)
    :config
    (setq tab-always-indent 'complete)
    (setq corfu-preview-current nil)
    (setq corfu-min-width 20)

    (setq corfu-popupinfo-delay '(1.25 . 0.5))
    (corfu-popupinfo-mode 1) ; shows documentation after `corfu-popupinfo-delay'

    ;; Sort by input history (no need to modify `corfu-sort-function').
    (with-eval-after-load 'savehist
      (corfu-history-mode 1)
      (add-to-list 'savehist-additional-variables 'corfu-history)))
#+end_src

** dabbrev
Set up to be used with corfu
#+begin_src emacs-lisp
  ;; Use Dabbrev with Corfu!
  (use-package dabbrev
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    (add-to-list 'dabbrev-ignored-buffer-modes 'authinfo-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode))
#+end_src

** multiple-cursors
#+begin_src emacs-lisp
  (use-package multiple-cursors
    :demand t)
#+end_src

** ace-window
#+begin_src emacs-lisp
  (use-package ace-window
    :ensure t)
#+end_src

* Initialize
#+begin_src emacs-lisp
  (provide 'packages)
#+end_src
